Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException Constructor
Overload List
Name | Description
ConnectiveGeometryException()
 Initializes a new instance of the ConnectiveGeometryException class with general connective geometry error message.
ConnectiveGeometryException(BentPlateGeometrySolver.OperationStatus, String)
 Initializes a new instance of the ConnectiveGeometryException class with connective geometry error message based on status.
Top
See Also
Reference
ConnectiveGeometryException Class
Tekla.Structures.Model Namespace